wakeUpMessageEnvelope.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:servicens="http://service/">
    <soapenv:Header/>
    <soapenv:Body>
        <servicens:wakeUp>
            <name>Benjamin</name>
        </servicens:wakeUp>
    </soapenv:Body>
</soapenv:Envelope>